package p3111.redgry.bundles;

import java.util.ListResourceBundle;

public class ClassLanguage_ua_UA extends ListResourceBundle{
    private static final Object[][] contents = {
            {"hello", "Здоров!"},
            {"windowClose", "Вікно повідомлень закрито"},
            {"err_login", "Неправильний логін або пароль! \nСпробуйте знову"},
            {"suc_login", "Ви успішно увійшли в систему!"},
            {"suc_register", "Ви зареєстровані! \nСпробуйте увійти."},
            {"err_register", "Пользоватлеь з таким ніком вже створений. \nСпробуйте знову!"},
            {"Entry", "Входу"},
            {"Info", "Інформація"},
            {"HairColor", "Колір волосся"},
            {"update", "Оновлення"},
            {"WriteId", "Ввівши ID"},
            {"uPick", "Ви вибрали"},
            {"PersonCreatedByUser", "Person створений користувачем: "},
            {"with", "\n з "},
            {"Pname", "\n{Ім'я: '"},
            {"cooridanateX", ",\n Координата {x= "},
            {"Pheight", "},\n Зростання: "},
            {"Pbirthday", ",\n Уродини: "},
            {"PpassportID", ",\n ID паспорта: "},
            {"PhairColor", ",\n Колір волосся: "},
            {"LocationName", ",\n Назва локації: "},
            {"LocationX", ",\n Координати локації{ x= "},

            //Блок arg.fxml:
            {"InputData", "Вхідні дані"},
            {"count_less_number", "Ввівши V"},
            {"input_id", "Ввівши ID"},
            {"delete_id", "Видалити об'єкт"},
            {"input_birthday", "Введіть дату YYYY-MM-DD"},
            {"add", "Додати об'єкт"},

            //Блок authorization.fxml:
            {"selectLanguage", "Вибрати мову"},
            {"registrationLogin", "Реєстрація / Вхід"},
            {"loginBut", "увійти"},
            {"regBut", "реєстрація"},

            //Блок personDialog.fxml:
            {"parameters_person", "Введіть параметри Person"},



            //Блок команд:
            {"suc_help", "remove_greater_key: Видалити з колекції всі елементи, ключ яких перевищує заданий.\n" +
                    "clear: Очистити колекцію (видаляє з колекції елементи належать вам).\n" +
                    "show: Вивести в стандартний потік виводу всі елементи колекції в рядковому поданні.\n" +
                    "insert: Додати новий елемент із заданим ключем.\n" +
                    "update: Оновити значення елемента колекції, id якого дорівнює заданому.\n" +
                    "history: Вивести останні 15 команд (без аргументів).\n" +
                    "remove_greater: Видалити з колекції всі елементи, що перевищують заданий.\n" +
                    "print_ascending: Вивести ID елементів колекції в порядку зростання.\n" +
                    "count_less_than_location: Вивести кількість елементів, значення поля location яких менше заданого.\n" +
                    "exit: Завершення роботи програми без збереження.\n" +
                    "help: Виводить довідку за доступними командам.\n" +
                    "remove_any_by_birthday: Видалити з колекції один елемент, значення поля birthday якого еквівалентно заданому. (Формат дати: YYYY-MM-DD)\n" +
                    "remove_key: Видалити елемент з колекції по його id.\n" +
                    "info: Виводить в стандартний потік інформацію про колекцію."},
            {"suc_info", "Інформація: "},
            {"count_less", "Елементів в колекції менше за твором координат локації заданому числу: "},
            {"collection_empty", "Колекція порожня!"},
            {"print_ascending", "ID колекції в порядку зростання:\n"},
            {"suc_insert", "Персонаж успішно доданий!"},
            {"suc_update", "Персонаж успішно оновлений з ID: "},
            {"err_insert", "Персонаж вже існує з даним ключем."},
            {"err_updateUser", "Персонаж не належить вам з ID: "},
            {"err_update", "Даного персонажа ви не можете оновити тому його немає в колекції."},
            {"suc_clear", "Колекція успішно очищена! \nВсі елементи належать вам були видалені!"},
            {"suc_remove", "Персонаж видалений з ID: "},
            {"err_remove", "Персонаж не знайдений або не належить вам з ID: "},
            {"suc_history", "Історія команд:\n"},
            {"err_removeBirthday", "У колекції немає персонажів з даною датою народження."},
            {"suc_removeBirthday", "З колекції були видалені всі персонажі з вказаною датою народження належать вам! \n"},
            {"err_greater", "Персонаж вже існує з даними ID."},
            {"error_greater", "У колекції немає персонажів, що перевищують ID: "},
            {"suc_greater", "Персонажі належать вам видалені з перевищує ID: "},

            //Блок Ошибок:
            {"Error", "Помилка"},
            {"error_arg", "Команді не було вказано агрумент або був неправильного формату!"},
            {"InvalidData", "Неправильні дані команди!"},
            {"IncorrectField", "Невірно заповнені поля!"},
            {"IncorrectNumber", "Число вийшло за діапазон!"},
            {"IncorrectDataField", "Невірно заповнене поле!"},
            {"ErrorCreatingObject", "Помилка створення об'єкта"},
            {"UnexpectedException", "Несподіваний виняток"},
            {"incorrectLogPas", "Некоректний логін або Пароль."},
            {"uncorrectLogPas", "Введіть інший логін або пароль!"},
            {"idNotFound", "Песонаж з даними ID не знайдений!"},
            {"error_argBirthday", "Неправильний формат дати! \nФормат дати: YYYY-MM-DD"},


            //Блок main.fxml:
            {"file", "Файл"},
            {"exit", "Вихід"},

            {"help", "Допомога"},
            {"info", "Інформація про колекцію"},
            {"helpCom", "Інформація про команди"},

            {"language", "Вибрати мову"},

            {"username", "Користувач: "},
            {"updateTable", "Оновити значення таблиці"},

            {"addCommands", "Команди Додавання:"},
            {"insertCom", "Додати Персонажа"},

            {"removeCommands", "Команди Видалення:"},
            {"removeID", "Видалити по ID"},
            {"removeBirthday", "Видалити по Дню народження"},
            {"removeGreater", "Видалити великих Персонажа"},
            {"removeGreaterID", "Видалити великих ID"},
            {"clearCom", "Очистивши"},

            {"updateCommands", "Команди Оновлення:"},
            {"updateCom", "Оновити"},

            {"printCommands", "Команди Виводу:"},
            {"countLessCom", "Вивести кількість <V локації"},
            {"printCom", "ID Песонажей по зростанню"},
            {"historyCom", "Історія команд"},

            {"tabPerson", "Таблиця Person"},
            {"tabVisual", "Область візуалізації"}
    };


    @Override
    protected Object[][] getContents() {
        return contents;
    }
}